init.org
** テストコード
   :PROPERTIES:
   :EXPORT_FILE_NAME: _index
   :EXPORT_HUGO_CUSTOM_FRONT_MATTER: :pre "<b>8. </b>" :weight 8 :disableToc true
   :END:

   一部のコマンドなどの設定を書き始めているので設けたセクション。

   暫定的にここに置いているが設定と近い方が良さそうなので
   いずれドキュメント内の位置を移動しそう。

   - [[*実行方法][実行方法]] :: とりあえず書かれているテストを動かす方法を書いている。
   - [[*run-tests][run-tests]] :: テスト全体を動かすための共通設定ファイルの説明
   - [[*my-org-commands-test][my-org-commands-test]] :: org-mode 用に自分が生やしたコマンドのテストファイルの解説

** 実行方法
   :PROPERTIES:
   :EXPORT_FILE_NAME: execution
   :EXPORT_HUGO_CUSTOM_FRONT_MATTER: :weight 1
   :END:

   テストする時は以下のように叩いたら動く。

   #+begin_src sh
   emacs -Q --batch -l ~/.emacs.d/inits/test/*-test.el -l ~/.emacs.d/inits/test/run-tests.el
   #+end_src

   今まで ~.emacs.d~ にいる状態でしか叩いたことないので
   他の場所にいる時に実行しても大丈夫かはわからない。

   単体でテストしたい時は

   #+begin_example
   -l ~/.emacs.d/inits/test/*-test.el
   #+end_example

   の部分を書き換えたらいいんじゃないかな。やったことないけど。

** run-tests
   :PROPERTIES:
   :EXPORT_FILE_NAME: run-tests
   :EXPORT_HUGO_CUSTOM_FRONT_MATTER: :weight 2
   :END:

   読み込んだテストをまるっとテストするためのコードをとりあえず置いている。

   #+begin_src emacs-lisp :tangle inits/test/run-tests.el
  (if noninteractive
      (let ((ert-quiet t))
        (ert-run-tests-batch-and-exit)))
   #+end_src

   後述の [[*テストライブラリの読み込み][テストライブラリの読み込み]] などはここで担うべきかとも考えるが
   今はテストファイルが1つしかないので気にしないことにする。

** my-org-commands-test
   :PROPERTIES:
   :EXPORT_FILE_NAME: my-org-commands-test
   :EXPORT_HUGO_CUSTOM_FRONT_MATTER: :weight 3
   :END:

   org-mode 用に定義したコマンドや関数のテストコード

*** Setup
**** テストライブラリの読み込み

     標準でついてくる ert を採用しているのでそれを読み込んでいる。

     #+begin_src emacs-lisp :tangle inits/test/68-my-org-commands-test.el
     (require 'ert)
     #+end_src

**** el-get の設定の読み込み

     プラグイン管理には el-get を利用しているので
     その設定ファイルを読み込んでいる。

     #+begin_src emacs-lisp :tangle inits/test/68-my-org-commands-test.el
     ;; プラグイン読み込みの前準備
     (load (expand-file-name (concat user-emacs-directory "/init-el-get.el")))
     #+end_src

**** テスト補助のプラグイン読み込み
***** with-simulated-input

      上で説明しているが、
      入力をシミュレートするためのプラグインをテストで利用しているので
      ここで読み込んでいる。

      #+begin_src emacs-lisp :tangle inits/test/68-my-org-commands-test.el
      ;; 入力シミュレート用のプラグイン
      (load (expand-file-name (concat user-emacs-directory "/inits/99-with-simulated-input")))
      #+end_src

**** 依存プラグインの読み込み                                   :improvement:

     テスト対象が依存しているプラグインを読み込んでいる。
     本来は init.el などの設定ファイルを全部読み込んだ状態でテストをした方が良さそうだが
     現状だとその状態で GitHub Actions で動かせる方法がわからないので
     一旦個別に読み込むようにしている。

***** swiper

      ivy-read を使った機能のテストをするので読み込んでいる。

      #+begin_src emacs-lisp :tangle inits/test/68-my-org-commands-test.el
      (el-get-bundle abo-abo/swiper)
      #+end_src

**** テスト対象の読み込み

     テストしたいファイルをここで読んでる。

     #+begin_src emacs-lisp :tangle inits/test/68-my-org-commands-test.el
     ;; テスト対象の読み込み
     (load (expand-file-name (concat user-emacs-directory "/inits/68-my-org-commands.el")))
     #+end_src

*** ert-deftest
**** test:my/org-todo-keyword-strings

     ~org-todo-keywords~ から "|" という区切りを除外したり
     "(s)" とかのような高速アクセスのためのキーワードは
     ivy で選択する時には邪魔なので除外したい、ということを表現したテスト。

     #+begin_src emacs-lisp :tangle inits/test/68-my-org-commands-test.el
     (ert-deftest test:my/org-todo-keyword-strings ()
       "Test of `my/org-todo-keyword-strings'."
       (let ((org-todo-keywords '((sequence "TODO" "DOING(!)" "WAIT" "|" "DONE(!)" "SOMEDAY(s)"))))
         (should (equal '("TODO" "DOING" "WAIT" "DONE" "SOMEDAY")
                        (my/org-todo-keyword-strings)))))
     #+end_src

     なお、ここでテストしている関数では
     TODO キーワードを ivy で扱いやすいように整えているだけで
     実際の選択は別の関数が担っている

**** test:my/org-todo

     org-todo を ivy で選択する関数のテストを書いている。

     #+begin_src emacs-lisp :tangle inits/test/68-my-org-commands-test.el
     (ert-deftest test:my/org-todo ()
       "Test of `my/org-todo'."
       (let ((org-todo-keywords '((sequence "TODO" "DOING(!)" "WAIT" "|" "DONE(!)" "SOMEDAY(s)")))
             (result))
         ;; org-mode を読まずに済むように org-todo を差し替えてテストしている
         (cl-letf (((symbol-function 'org-todo)
                    (lambda (keyword)
                      (setq result keyword))))
           (with-simulated-input "DOI RET" (my/org-todo))
           (should (equal "DOING" result)))))
     #+end_src

     ポイントは cl-letf を使って、内部で叩いている関数 ~org-todo~ を一時的に

     #+begin_src emacs-lisp
     (lambda (keyword)
       (setq result keyword))
     #+end_src

     に差し替えているところ。

     org-mode を呼び出さずに代わりの関数に差し替えているので
     テストがしやすくなっている。Stub 的なやつかな。

     何度も使うならこの差し替え処理自体をテストヘルパーにしても良いかもしれない。

     また ivy で選択するので with-simulated-input を使って入力操作を代替している。便利。

* 未整理

  ここにはとりあえず inits 以下に出力できるようにしただけの記述を連ねていきます。
  あとで移動する。

** exec-path

   #+begin_src emacs-lisp :tangle inits/00-exec-path.el
   ;; for exec path
   ;; use .bashrc setted path
   (el-get-bundle exec-path-from-shell)
   (when (memq window-system '(mac ns))
     (exec-path-from-shell-initialize))
   #+end_src

** load-path

   #+begin_src emacs-lisp :tangle inits/00-load-path.el
   (add-to-list 'load-path (expand-file-name "~/.emacs.d/secret"))
   (defun my/load-config (file)
     (condition-case nil
         (load file)
       (file-missing (message "Load error: %s" file))))
   #+end_src

** savehist

   #+begin_src emacs-lisp :tangle inits/00-savehist.el
   (savehist-mode 1)
   (setq savehist-additional-variables '(kill-ring))
   #+end_src

** load-libraries

   #+begin_src emacs-lisp :tangle inits/01-load-libraries.el
   (el-get-bundle s)
   (require 's)
   #+end_src

** override

   #+begin_src emacs-lisp :tangle inits/01-override.el
   ;; posframe が最初に空行があると最後の行を表示しないため
   ;; 一時的にこちらを直してみている
   (with-eval-after-load 'pretty-hydra
     (defun pretty-hydra--maybe-add-title (title docstring)
     "Add TITLE to the DOCSTRING if it's not nil, other return DOCSTRING unchanged."
     (if (null title)
         docstring
       (format "%s\n%s"
               (cond
                ((char-or-string-p title) title)
                ((symbolp title)          (format "%%s`%s" title))
                ((listp title)            (format "%%s%s" (prin1-to-string title)))
                (t                        ""))
               docstring))))
   #+end_src

** auto-save

   #+begin_src emacs-lisp :tangle inits/10-auto-save.el
   (setq auto-save-timeout 15)
   (setq auto-save-interval 60)
   (setq auto-save-file-name-transforms '((".*" "~/.emacs.d/backup/" t)))
   (setq backup-directory-alist '((".*" . "~/.emacs.d/backup")
                                  (,tramp-file-name-regexp . nil)))

   (setq version-control t)
   (setq delete-old-versions t)
   #+end_src

** migemo

   #+begin_src emacs-lisp :tangle inits/10-migemo.el
   (el-get-bundle migemo)
   (load "migemo")

   ;; Mac
   (let ((path "/usr/local/share/migemo/utf-8/migemo-dict"))
     (if (file-exists-p path)
         (setq migemo-dictionary path)))

   ;; Ubuntu
   (let ((path "/usr/share/cmigemo/utf-8/migemo-dict"))
     (if (file-exists-p path)
         (setq migemo-dictionary path)))

   (let ((path (s-chomp (shell-command-to-string "which cmigemo"))))
     (if (s-ends-with? "not found" path)
         (message "cmigemo not found")
       (setq migemo-command path)))

   (setq migemo-options '("-q" "--emacs"))
   (setq migemo-coding-system 'utf-8-unix)
   (migemo-init)
   #+end_src

** ace-window

   #+begin_src emacs-lisp :tangle inits/20-ace-window.el
   (el-get-bundle ace-window)
   #+end_src

** alert

   #+begin_src emacs-lisp :tangle inits/20-alert.el
   ;; alert.el configuration
   ;; https://github.com/jwiegley/alert
   (el-get-bundle alert)
   (setq alert-default-style 'notifier) ;; use terminal-notifier
   #+end_src

** all-the-icons

   #+begin_src emacs-lisp :tangle inits/20-all-the-icons.el
   (el-get-bundle all-the-icons)
   (require 'all-the-icons)
   ;; (all-the-icons-install-fonts) unless installed

   (with-eval-after-load 'pretty-hydra
     (pretty-hydra-define all-the-icons-hydra (:separator "-" :title "All the icons" :exit t :quit-key "q")
       ("Insert"
        (("a" all-the-icons-insert-alltheicon "All the icons")
         ("f" all-the-icons-insert-fileicon   "File icons")
         ("F" all-the-icons-insert-faicons    "FontAwesome")
         ("m" all-the-icons-insert-material   "Material")
         ("o" all-the-icons-insert-octicon    "Octicon")
         ("w" all-the-icons-insert-wicon      "Weather")
         ("*" all-the-icons-insert            "All")))))
   #+end_src

** browse-url

   #+begin_src emacs-lisp :tangle inits/20-browse-url.el
   (setq browse-url-generic-program "vivaldi")
   #+end_src

** emojify

   #+begin_src emacs-lisp :tangle inits/20-emojify.el
   (el-get-bundle emojify)
   (el-get-bundle dash)
   (global-emojify-mode 1)
   (global-emojify-mode-line-mode 1)
   #+end_src

** google-this

   #+begin_src emacs-lisp :tangle inits/20-google-this.el
   (el-get-bundle google-this)

   (with-eval-after-load 'pretty-hydra
     (pretty-hydra-define google-this-pretty-hydra
       (:foreign-keys warn :title "Google" :quit-key "q" :color blue :separator "-")
       ("Current"
        (("SPC" google-this-noconfirm "No Confirm")
         ("RET" google-this           "Auto")
         ("w"   google-this-word      "Word")
         ("l"   google-this-line      "Line")
         ("s"   google-this-symbol    "Symbol")
         ("r"   google-this-region    "Region")
         ("e"   google-this-error     "Error"))

        "Feeling Lucky"
        (("L"   google-this-lucky-search         "Lucky")
         ("i"   google-this-lucky-and-insert-url "Insert URL"))

        "Tool"
        (("W" google-this-forecast "Weather")))))
   #+end_src

** google-translate

   #+begin_src emacs-lisp :tangle inits/20-google-translate.el
   (el-get-bundle google-translate)
   #+end_src

** helm

   #+begin_src emacs-lisp :tangle inits/20-helm.el
   ;; helm 系の設定は他の部分への影響も大きそうなので先に持って来た
   (el-get-bundle helm)
   (el-get-bundle helm-descbinds)
   (el-get-bundle helm-ag)
   (require 'helm-config)
   (helm-descbinds-mode)
   (helm-migemo-mode 1)
   #+end_src

** lsp

   #+begin_src emacs-lisp :tangle inits/20-lsp.el
   (el-get-bundle lsp-mode)
   (el-get-bundle lsp-ui)
   (add-hook 'lsp-mode-hook 'lsp-ui-mode)
   (setq lsp-ui-doc-alignment 'window)
   #+end_src

** posframe

   #+begin_src emacs-lisp :tangle inits/20-posframe.el
   (el-get-bundle posframe)
   #+end_src

** smartparens

   #+begin_src emacs-lisp :tangle inits/20-smartparens.el
   (el-get-bundle smartparens)
   (require 'smartparens-config)
   #+end_src

** uniquify

   #+begin_src emacs-lisp :tangle inits/20-uniquify.el
   ;; 同じ名前のファイルを開いている時に祖先ディレクトリ名を表示してくれてわかりやすくしてくれるやつ
   (require 'uniquify) ;; includes Emacs
   (setq uniquify-buffer-name-style 'post-forward-angle-brackets)
   #+end_src

** 20-yasnippet.el

   #+begin_src emacs-lisp :tangle inits/20-yasnippet.el
   (el-get-bundle yasnippet)
   (yas-global-mode 1)

   (with-eval-after-load 'pretty-hydra
     (pretty-hydra-define
       yasnippet-hydra (:separator "-" :title "Yasnippet" :foreign-key warn :quit-key "q" :exit t)
       ("Edit"
        (("n" yas-new-snippet        "New")
         ("v" yas-visit-snippet-file "Visit"))

        "Other"
        (("i" yas-insert-snippet  "Insert")
         ("l" yas-describe-tables "List")
         ("r" yas-reload-all      "Reload all")))))
   #+end_src

** company

   #+begin_src emacs-lisp :tangle inits/30-company.el
   (el-get-bundle company-mode)
   (with-eval-after-load 'company
     ;; active
     (define-key company-active-map (kbd "C-s") 'company-search-candidates))
   #+end_src

** 30-flycheck.el

   #+begin_src emacs-lisp :tangle inits/30-flycheck.el
   (el-get-bundle flycheck)
   (el-get-bundle flycheck-pos-tip)

   (with-eval-after-load 'flycheck
     (flycheck-pos-tip-mode))
   #+end_src

** 30-git-gutter-fringe.el

   #+begin_src emacs-lisp :tangle inits/30-git-gutter-fringe.el
   (el-get-bundle git-gutter-fringe)
   (global-git-gutter-mode t)
   #+end_src

** 30-highlight-indent-guides.el

   #+begin_src emacs-lisp :tangle inits/30-highlight-indent-guides.el
   (el-get-bundle DarthFennec/highlight-indent-guides)
   (setq highlight-indent-guides-responsive "stack")
   #+end_src

** 30-notify-slack.el

   #+begin_src emacs-lisp :tangle inits/30-notify-slack.el
   (my/load-config "my-notify-slack-config")

   (setq my/notify-slack-enable-p t)

   (defun my/notify-slack-toggle ()
     (interactive)
     (if my/notify-slack-enable-p
         (setq my/notify-slack-enable-p nil)
       (setq my/notify-slack-enable-p t)))

   (defun my/notify-slack (channel text)
     (if my/notify-slack-enable-p
         (start-process "my/org-clock-slack-notifier" "*my/org-clock-slack-notifier*" "my-slack-notifier" channel text)))

   (defun my/notify-slack-times (text)
     (my/notify-slack my/notify-slack-times-channel text))
   #+end_src

