init.org
** 30-projectile.el

   #+begin_src emacs-lisp :tangle inits/30-projectile.el
   (el-get-bundle projectile)

   (el-get-bundle helm-projectile)
   (helm-projectile-on)

   (projectile-mode)

   ;; 無視するディレクトリ
   (add-to-list 'projectile-globally-ignored-directories "tmp")
   (add-to-list 'projectile-globally-ignored-directories ".tmp")
   (add-to-list 'projectile-globally-ignored-directories "vendor")
   (add-to-list 'projectile-globally-ignored-directories ".sass-cache")
   (add-to-list 'projectile-globally-ignored-directories "coverage")
   (add-to-list 'projectile-globally-ignored-directories "cache")
   (add-to-list 'projectile-globally-ignored-directories "log")

   ;; 無視するファイル
   (add-to-list 'projectile-globally-ignored-files "gems.tags")
   (add-to-list 'projectile-globally-ignored-files "project.tags")
   (add-to-list 'projectile-globally-ignored-files "manifest.json")

   (setq projectile-completion-system 'ivy)
   (el-get-bundle counsel-projectile)

   (with-eval-after-load 'pretty-hydra
     (pretty-hydra-define
       projectile-hydra (:separator "-" :title "Projectile" :foreign-key warn :quit-key "q" :exit t)
       ("File"
        (("f" counsel-projectile-find-file "Find File")
         ("d" counsel-projectile-find-dir "Find Dir")
         ("r" projectile-recentf "Recentf"))

        "Other"
        (("p" (counsel-projectile-switch-project 'neotree-dir) "Switch Project")))))
   #+end_src

** 30-show-paren.el

   #+begin_src emacs-lisp :tangle inits/30-show-paren.el
   (show-paren-mode 1) ;; http://syohex.hatenablog.com/entry/20110331/1301584188
   #+end_src

** 30-skk.el

   #+begin_src emacs-lisp :tangle inits/30-skk.el
   (el-get-bundle ddskk)
   (add-hook 'skk-load-hook
             (lambda ()
               ;; コード中では自動的に英字にする。
               (require 'context-skk)

               (setq skk-comp-mode t) ;; 動的自動補完
               (setq skk-auto-insert-paren t) ;; 閉じ括弧の自動補完
               (setq skk-delete-implies-kakutei nil) ;; ▼モードで BS を押した時に一つ前の候補を表示
               (setq skk-sticky-key ";") ;; sticky-shift key
               (setq skk-henkan-strict-okuri-precedence t) ;; 見出し語と送り仮名がマッチした候補を優先して表示
               (setq skk-show-annotation t) ;; 単語の意味をアノテーションとして表示。例) いぜん /以前;previous/依然;still/

               ;; 半角で入力したい文字
               (setq skk-rom-kana-rule-list
                     (nconc skk-rom-kana-rule-list
                            '((";" nil nil)
                              (":" nil nil)
                              ("?" nil nil)
                              ("!" nil nil))))))

   (setq skk-extra-jisyo-file-list (list '("~/.emacs.d/skk-jisyo/SKK-JISYO.lisp" . japanese-iso-8bit-unix)))

   ;; AquaSKKのL辞書をつかうようにする
   (let ((l-dict (expand-file-name "~/Library/Application Support/AquaSKK/SKK-JISYO.L")))
     (if (file-exists-p l-dict)
         (setq skk-large-jisyo l-dict)))

   (el-get-bundle conao3/ddskk-posframe.el)
   (ddskk-posframe-mode 1)
   #+end_src

** 30-whitespace.el

   #+begin_src emacs-lisp :tangle inits/30-whitespace.el
   (require 'whitespace)
   (setq whitespace-style '(face           ; faceで可視化
                            trailing       ; 行末
                            tabs           ; タブ
                            spaces         ; スペース
                            empty          ; 先頭/末尾の空行
                            space-mark     ; 表示のマッピング
                            tab-mark))

   (setq whitespace-display-mappings
         '((space-mark ?\u3000 [?\u25a1])
           ;; WARNING: the mapping below has a problem.
           ;; When a TAB occupies exactly one column, it will display the
           ;; character ?\xBB at that column followed by a TAB which goes to
           ;; the next TAB column.
           ;; If this is a problem for you, please, comment the line below.
           (tab-mark ?\t [?\u00BB ?\t] [?\\ ?\t])))

   ;; スペースは全角のみを可視化
   (setq whitespace-space-regexp "\\(\u3000+\\)")

   ;; 行末の空白も表示
   (setq whitespace-trailing-regexp  "\\([ \u00A0]+\\)$")

   ;; 保存前に自動でクリーンアップ
   (setq whitespace-action '(auto-cleanup))
   (global-whitespace-mode 1)
   #+end_src

** 35-magit.el

   #+begin_src emacs-lisp :tangle inits/35-magit.el
   (el-get-bundle magit)
   #+end_src

** 36-forge.el

   #+begin_src emacs-lisp :tangle inits/36-forge.el
   ;; magit と github を連携させるやつ
   (el-get-bundle forge)

   (with-eval-after-load 'magit
     (require 'forge))
   #+end_src

** 40-dumb-jump.el

   #+begin_src emacs-lisp :tangle inits/40-dumb-jump.el
   (el-get-bundle dumb-jump)
   (setq dumb-jump-default-project "~/projects")
   (setq dumb-jump-selector 'ivy)

   (with-eval-after-load 'pretty-hydra
     (pretty-hydra-define dumb-jump-pretty-hydra
       (:foreign-keys warn :title "Dumb jump" :quit-key "q" :color blue :separator "-")
       ("Go"
        (("j" dumb-jump-go "Jump")
         ("o" dumb-jump-go-other-window "Other window"))

        "External"
        (("e" dumb-jump-go-prefer-external "Go external")
         ("x" dumb-jump-go-prefer-external-other-window "Go external other window"))

        "Lock"
        (("l" dumb-jump-quick-look "Quick look"))

        "Other"
        (("b" dumb-jump-back "Back")))))
   #+end_src

** 40-emacs-lisp.el

   #+begin_src emacs-lisp :tangle inits/40-emacs-lisp.el
   (defun my/emacs-lisp-mode-hook ()
     (display-line-numbers-mode 1)
     (company-mode 1)
     (smartparens-mode 1)
     (turn-on-smartparens-strict-mode))
   (add-hook 'emacs-lisp-mode-hook 'my/emacs-lisp-mode-hook)

   (defun my/insert-all-the-icons-code (family)
     (let* ((candidates (all-the-icons--read-candidates-for-family family))
            (prompt     (format "%s Icon: " (funcall (all-the-icons--family-name family))))
            (selection  (completing-read prompt candidates nil t)))
       (insert "(all-the-icons-" (symbol-name family) " \"" selection "\")")))

   (with-eval-after-load 'major-mode-hydra
     (major-mode-hydra-define emacs-lisp-mode (:separator "-" :quit-key "q" :title (concat (all-the-icons-fileicon "elisp") " Emacs Lisp"))
       ("Describe"
        (("F" counsel-describe-function "Function")
         ("V" counsel-describe-variable "Variable"))

        "Insert Icon Code"
        (("@a" (my/insert-all-the-icons-code 'alltheicon) "All the icons")
         ("@f" (my/insert-all-the-icons-code 'fileicon)   "File icons")
         ("@F" (my/insert-all-the-icons-code 'faicon)     "FontAwesome")
         ("@m" (my/insert-all-the-icons-code 'material)   "Material")
         ("@o" (my/insert-all-the-icons-code 'octicon)    "Octicon")
         ("@w" (my/insert-all-the-icons-code 'wicon)      "Weather")))))
   #+end_src

** 40-es6.el

   #+begin_src emacs-lisp :tangle inits/40-es6.el
   (el-get-bundle js2-mode)
   (defun my/js2-mode-hook ()
     (flycheck-mode 1)
     (setq flycheck-disabled-checkers '(javascript-standard javascript-jshint))

     (company-mode 1)
     (turn-on-smartparens-strict-mode)

     (setq js2-basic-offset 2))
   (add-to-list 'auto-mode-alist '("\\.es6$" . js2-mode))
   (add-hook 'js2-mode-hook 'my/js2-mode-hook)
   #+end_src

** 40-gnuplot.el

   #+begin_src emacs-lisp :tangle inits/40-gnuplot.el
   (el-get-bundle gnuplot-mode)
   #+end_src

** 40-markdown.el

   #+begin_src emacs-lisp :tangle inits/40-markdown.el
   (el-get-bundle markdown-mode)
   #+end_src

** 40-ruby.el

   #+begin_src emacs-lisp :tangle inits/40-ruby.el
   (el-get-bundle rbenv)
   (global-rbenv-mode)
   (el-get-bundle enh-ruby-mode)

   (with-eval-after-load 'enh-ruby-mode
     (setq enh-ruby-add-encoding-comment-on-save nil)
     (setq enh-ruby-deep-indent-paren nil) ;; 有効にするとインデントが気持ち悪いのでOFF
     (setq enh-ruby-bounce-deep-indent t))

   ;; TODO: flycheck-mode 用の設定。単に有効にすると警告が多過ぎて無理
   (defun my/enh-ruby-mode-hook ()
     (company-mode 1)
     (lsp)
     (lsp-ui-mode 1)
     (turn-on-smartparens-strict-mode)
     (display-line-numbers-mode 1))

   (add-hook 'enh-ruby-mode-hook 'my/enh-ruby-mode-hook)
   (add-to-list 'context-skk-programming-mode 'enh-ruby-mode)

   (with-eval-after-load 'major-mode-hydra
     (major-mode-hydra-define enh-ruby-mode (:quit-key "q" :title (concat (all-the-icons-alltheicon "ruby-alt") " Ruby commands"))
       ("Enh Ruby"
        (("{" enh-ruby-toggle-block "Toggle block")
         ("e" enh-ruby-insert-end "Insert end"))

        "LSP"
        (("i" lsp-ui-imenu "Imenu")
         ("f" lsp-ui-flycheck-list "Flycheck list"))

        "RSpec"
        (("s" rspec-verify "Run associated spec")
         ("m" rspec-verify-method "Run method spec")
         ("r" rspec-rerun "Rerun")
         ("l" rspec-run-last-failed "Run last failed"))

        "REPL"
        (("I" inf-ruby "inf-ruby"))

        "Other"
        (("j" dumb-jump-go "Dumb Jump")))))
   #+end_src

** 40-scss.el

   #+begin_src emacs-lisp :tangle inits/40-scss.el
   (el-get-bundle rainbow-mode)
   (with-eval-after-load 'scss-mode
     (setq css-indent-offset 2))
   (defun my/scss-mode-hook ()
     (flycheck-mode 1)

     (setq-local lsp-prefer-flymake nil) ;; flycheck が有効にならなくなるのを防ぐ
     (lsp)
     (lsp-ui-mode -1) ;; lsp-ui が有効だと画面上でガチャガチャ height とかの説明をしてうざいので

     ;; lsp-ui とかより後に設定しないと上書きされるのでここに移動した
     (setq-local flycheck-checker 'scss-stylelint)
     (setq-local flycheck-check-syntax-automatically '(save new-line idle-change))

     (company-mode 1)
     (display-line-numbers-mode 1)

     (rainbow-mode))
   (add-hook 'scss-mode-hook 'my/scss-mode-hook)

   (with-eval-after-load 'major-mode-hydra
     (major-mode-hydra-define scss-mode (:quit-key "q" :title (concat (all-the-icons-alltheicon "css3") " CSS"))
       ("Edit"
        (("v" my/replace-var "replace-var")))))
   #+end_src

