inits/20-all-the-icons.el
      ("lF" (my/insert-all-the-icons-code 'faicon)      "FontAwesome")
      ("lm" (my/insert-all-the-icons-code 'material)    "Material")
      ("lo" (my/insert-all-the-icons-code 'octicon)     "Octicon")
      ("lw" (my/insert-all-the-icons-code 'wicon)       "Weather")))))
