init.org
** 40-view.el

   #+begin_src emacs-lisp :tangle inits/40-view.el
   ;; view-mode 用の設定

   ;; (define-key projectile-rails-mode-map (kbd "C-c r") 'pretty-hydra-projectile-rails-find/body)

   (defun my/setup-view-mode-keymap ()
       (let ((keymap view-mode-map))
         (define-key keymap (kbd "h") 'backward-char)
         (define-key keymap (kbd "j") 'next-line)
         (define-key keymap (kbd "k") 'previous-line)
         (define-key keymap (kbd "l") 'forward-char)

         (define-key keymap (kbd "e") 'forward-word)

         (define-key keymap (kbd "b")   'scroll-down)
         (define-key keymap (kbd "SPC") 'scroll-up)

         (define-key keymap (kbd "g") 'beginning-of-buffer)
         (define-key keymap (kbd "G") 'end-of-buffer)
         (define-key keymap (kbd "<") 'beginning-of-buffer)
         (define-key keymap (kbd ">") 'end-of-buffer)))

   (defun my/view-mode-hook ()
     (my/setup-view-mode-keymap))

   (add-hook 'view-mode-hook 'my/view-mode-hook)

   (defun my/toggle-view-mode ()
     "view-mode と通常モードの切り替えコマンド"
     (interactive)
     (cond (view-mode
            (hl-line-mode -1)
            (view-mode -1))
           (t
            (hl-line-mode 1)
            (view-mode 1))))
   #+end_src

** 40-yaml.el

   #+begin_src emacs-lisp :tangle inits/40-yaml.el
   (el-get-bundle yaml-mode)
   (defun my/yaml-mode-hook ()
     (highlight-indent-guides-mode 1))

   (add-hook 'yaml-mode-hook 'my/yaml-mode-hook)
   #+end_src

** 41-rails.el

   #+begin_src emacs-lisp :tangle inits/41-rails.el
   (el-get-bundle haml-mode)
   (el-get-bundle projectile-rails)
   (projectile-rails-global-mode 1)

   (defun my/projectile-rails-find-uploader ()
     "Find a Uploader."
     (interactive)
     (projectile-rails-find-resource
      "uploader: "
      '(("app/uploaders/" "\\(.+\\)\\.rb$"))
      "app/uploaders/${filename}.rb"))

   (defun my/projectile-rails-find-admin ()
     "Find a ActiveAdmin file."
     (interactive)
     (projectile-rails-find-resource
      "admin: "
      '(("app/admin/" "\\(.+\\)\\.rb$"))
      "app/admin/${filename}.rb"))

   (defun my/projectile-rails-find-form-object ()
     "Find a Form Object."
     (interactive)
     (projectile-rails-find-resource
      "form object: "
      '(("app/models/forms/" "\\(.+\\)\\.rb$"))
      "app/models/forms/${filename}.rb"))

   (defun my/projectile-rails-find-vue ()
     "Find a Vue."
     (interactive)
     (projectile-rails-find-resource
      "vue: "
      '(("app/javascript/" "\\(.+\\)\\.vue$"))
      "app/javascript/${filename}.vue"))

   (defun my/projectile-rails-find-webpack-js ()
     "Find a Webpack js."
     (interactive)
     (projectile-rails-find-resource
      "webpack js: "
      '(("app/javascript/" "\\(.+\\)\\.js$"))
      "app/javascript/${filename}.js"))

   (with-eval-after-load 'pretty-hydra
     (pretty-hydra-define pretty-hydra-projectile-rails-find (:separator "-" :color blue :foreign-keys warn :title "Projectile Rails" :quit-key "q")
       ("Current"
        (("M" projectile-rails-find-current-model      "Current model")
         ("V" projectile-rails-find-current-view       "Current view")
         ("C" projectile-rails-find-current-controller "Current controller")
         ("H" projectile-rails-find-current-helper     "Current helper")
         ("P" projectile-rails-find-current-spec       "Current spec")
         ("Z" projectile-rails-find-current-serializer "Current serializer"))

        "App"
        (("m" projectile-rails-find-model           "Model")
         ("v" projectile-rails-find-view            "View")
         ("c" projectile-rails-find-controller      "Controller")
         ("h" projectile-rails-find-helper          "Helper")
         ("a" my/projectile-rails-find-admin        "ActiveAdmin")
         ("f" my/projectile-rails-find-form-object  "Form object")
         ("@" projectile-rails-find-mailer          "Mailer")
         ("V" my/projectile-rails-find-vue          "Vue")
         ("J" my/projectile-rails-find-webpack-js   "Webpack js")
         ("u" my/projectile-rails-find-uploader     "Controller")
         ("!" projectile-rails-find-validator       "Validator")
         ;; ("y" projectile-rails-find-layout       "Layout")
         ("z" projectile-rails-find-serializer      "Serializer"))

        "Assets"
        (("j" projectile-rails-find-javascript  "Javascript")
         ;; ("w" projectile-rails-find-component)
         ("s" projectile-rails-find-stylesheet  "CSS"))

        "Other"
        (("n" projectile-rails-find-migration    "Migration")
         ("r" projectile-rails-find-rake-task    "Rake task")
         ("i" projectile-rails-find-initializer  "Initializer")
         ("l" projectile-rails-find-lib          "Lib")
         ("p" projectile-rails-find-spec         "Spec")
         ("t" projectile-rails-find-locale       "Translation"))

        "Single Files"
        (("R" projectile-rails-goto-routes   "routes.rb")
         ("G" projectile-rails-goto-gemfile  "Gemfile")
         ("D" projectile-rails-goto-schema   "schema.rb"))))
     (define-key projectile-rails-mode-map (kbd "C-c r") 'pretty-hydra-projectile-rails-find/body))
   #+end_src

** 41-vue.el

   #+begin_src emacs-lisp :tangle inits/41-vue.el
   (define-auto-insert "\\.vue$" "template.vue")

   (el-get-bundle vue-mode)
   (el-get-bundle hlissner/emacs-pug-mode)
   (defun my/css-mode-hook ()
     ;; vue-mode では scss は css-mode が適用される
     ;; https://github.com/AdamNiederer/vue-mode/blob/031edd1f97db6e7d8d6c295c0e6d58dd128b9e71/vue-mode.el#L63
     (setq-local flycheck-checker 'css-stylelint)
     (rainbow-mode 1))

   (defun my/vue-mode-hook ()
     (display-line-numbers-mode t)
     (lsp)
     (flycheck-mode 1))

   (add-hook 'css-mode-hook 'my/css-mode-hook)
   (add-hook 'vue-mode-hook 'my/vue-mode-hook)

   (with-eval-after-load 'major-mode-hydra
     (major-mode-hydra-define css-mode (:quit-key "q" :title (concat (all-the-icons-alltheicon "css3") " CSS"))
       ("Edit"
        (("v" my/replace-var "replace-var")))))
   #+end_src

** 42-rspec.el

   #+begin_src emacs-lisp :tangle inits/42-rspec.el
   (el-get-bundle rspec-mode)

   ;; rspec 実行バッファで byebug などで止った際に
   ;; C-x C-q したら inf-ruby が動くようにする
   ;; byebug か binding.irb 推奨。
   ;; binding.pry は何故かまともに動かない
   (add-hook 'after-init-hook 'inf-ruby-switch-setup)

   ;; C-c C-c で現在の行のテストを実行
   (define-key rspec-mode-map (kbd "C-c C-c") 'rspec-verify-single)
   #+end_src

** 50-browse-at-point.el

   #+begin_src emacs-lisp :tangle inits/50-browse-at-point.el
   (el-get-bundle browse-at-remote)
   #+end_src

** 50-ido.el

   #+begin_src emacs-lisp :tangle inits/50-ido.el
   (ido-mode 1) ;; includes Emacs
   (setq ido-enable-flex-matching t)
   #+end_src

** 50-multiple-cursor.el

   #+begin_src emacs-lisp :tangle inits/50-multiple-cursor.el
   (el-get-bundle multiple-cursors)
   #+end_src
* Footnotes
* COMMENT Local Variables                          :ARCHIVE:
# Local Variables:
# eval: (org-hugo-auto-export-mode)
# End:
